#+TITLE: Homebrew : Fetch us a pint o' Gerbil!

I just got a Mac. I need to run gerbil. Bleeding edge even!

#+begin_src sh
./build.sh env bash
cd std/crypto
gxc -s -S libcrypto.ss
cd ~/.gerbil/lib/std/crypto
gsc -link -flat -o libcrypto__0.o1.c -e '(include "~~lib/_gambit#.scm")' ~/.gerbil/lib/std/crypto/libcrypto__0
gsc -obj -cc-options -D___DYNAMIC libcrypto__0.c libcrypto__0.o1.c

## all this should succeed and now we get to the link phase, which is what we are trying to debug:

## current incantation is (you need to sub the XXX with /path/to/brew-ssl-libdir):

gcc -shared -o libcrypto.o1 libcrypto__0.o libcrypto__0.o1.o -L XXX -lssl

#+end_src

#+begin_src sh
./build.sh env bash
export DYLD_LIBRARY_PATH="$LD_LIBRARY_PATH"
cd std/net/ssl
gxc -s -S libssl.ss
cd ~/.gerbil/lib/std/net/ssl/
gsc -link -flat -o libssl__0.o1.c -e '(include "~~lib/_gambit#.scm")' ~/.gerbil/lib/std/net/ssl/libssl__0
gsc -obj -cc-options -D___DYNAMIC libssl__0.c libssl__0.o1.c
gcc -shared -o libssl.o1 libssl__0.o libssl__0.o1.o `pkg-config --libs libssl` `pkg-config --libs libcrypto` -L${LD_LIBRARY_PATH} -lgambit
#+end_src

* Development, AKA =gerbil-scheme-local=

For testing I need to make this all local and quick. To start with I'll make a branch, commit to it, and try to build from there.

#+begin_src sh
  git checkout -b homebrew-v18
  # Save the file (in emacs of course!)
  git add homebrew/README.org
  git commit -m "Add homebrew/README.org"
#+end_src


So now we have a working dev branch.

When running it fails with

    : configure:3710: gcc-13 -foptimize-sibling-calls  -Wl,-rpath=/usr/local/Cellar/gerbil-scheme-local/0.18-dev/v0.17.0-217-gb5512b8e/lib conftest.c  >&5
    : ld: unknown option: -rpath=/usr/local/Cellar/gerbil-scheme-local/0.18-dev/v0.17.0-217-gb5512b8e/lib=

    What if I change the === to a =,=?

    Let's make a patch.

    #+begin_src sh :results verbatim :wrap src diff
      git diff ../configure
    #+end_src

    #+begin_src diff
    diff --git a/configure b/configure
    index 4ddec719..78fa270f 100755
    --- a/configure
    +++ b/configure
    @@ -65,6 +65,13 @@ prefix="/opt/gerbil"
     readonly cflags_opt="-foptimize-sibling-calls"
     readonly ldflags_rpath="-Wl,-rpath"

    +if [ $(uname) = "Darwin" ];
    +then
    +    readonly rpath_sep=","
    +else
    +    readonly rpath_sep="="
    +fi
    +
     gambit_march="native"
     gambit_tag="${default_gambit_tag}"
     gambit_config="${default_gambit_config}"
    @@ -194,11 +201,10 @@ if [ -z "${CFLAGS}" ]; then
     else
	 CFLAGS="${CFLAGS} ${cflags_opt}"
     fi
    -
     if [ -z "${LDFLAGS}" ]; then
    -    LDFLAGS="${ldflags_rpath}=${gerbil_prefix}/lib"
    +    LDFLAGS="${ldflags_rpath}$rpath_sep${gerbil_prefix}/lib"
     else
    -    LDFLAGS="${LDFLAGS} ${ldflags_rpath}=${gerbil_prefix}/lib"
    +    LDFLAGS="${LDFLAGS} ${ldflags_rpath}$rpath_sep${gerbil_prefix}/lib"
     fi

     git submodule init || die
    #+end_src


    commit it.

    #+begin_src sh
      git add ../configure
      git commit -m "Try a different separator for rpath on Darwin"
    #+end_src

    Trying again got a new failure. in expander/root.ss there are the features we need.

    #+begin_src sh :results verbatim :wrap src diff
      git diff ../src/build/*
    #+end_src

    #+begin_src diff
      diff --git a/src/build/build-bach.ss b/src/build/build-bach.ss
      index 3efa9c5f..f6df5079 100644
      --- a/src/build/build-bach.ss
      +++ b/src/build/build-bach.ss
      @@ -112,7 +112,8 @@
      	    (output-bin
      	     (path-expand "gerbil" gerbil-bindir))
      	    (cc-options
      -        (string-append "-Wl,-rpath=" gambit-libdir)))
      +        (string-append (cond-expand (darwin "-Wl,-rpath,") (else "-Wl,-rpath="))
      +		       gambit-libdir)))
         (displayln "... build " output-bin)
         (invoke (gerbil-gsc)
      	       [gsc-runtime-args
    #+end_src

    #+begin_src sh
      git add ../src/build/build-bach.ss
      git commit -m "Try a different separator for rpath on Darwin on build-bach.ss"
    #+end_src

    #+RESULTS:
    | [homebrew-v18 5d2e89e5] Try a different separator for rpath on Darwin on build-bach.ss |                 |               |
    | 1 file changed                                                                         | 2 insertions(+) | 1 deletion(-) |

    
#+begin_src ruby :tangle gerbil-scheme-local.rb
  class GerbilSchemeLocal < Formula
    url "file:///Users/drewc/me/src/gerbil", using: :git, branch: "homebrew-v18"
    license any_of: ["LGPL-2.1-or-later", "Apache-2.0"]
    version "0.18-dev"
    depends_on "openssl@3"

    On_macos do
      depends_on "gcc"
    end

    # Clang is slower both for compiling and for running output binaries
    fails_with :clang

    def install
        system "./configure", "--prefix=#{prefix}",
                                    "--enable-leveldb",
                                    "--enable-libxml",
                                    "--enable-libyaml",
                                    "--enable-lmdb"
              
      # Dir.chdir('src/gambit'){

      #   # Fixed in gambit HEAD, but they haven't cut a release
      #   inreplace "config.status" do |s|
      #     s.gsub! %r{/usr/local/opt/openssl(@\d(\.\d)?)?}, Formula["openssl@3"].opt_prefix
      #   end
      #   system "./config.status"

      #   # fix lisp file install location
      #   #        elisp.install share/"emacs/site-lisp/gambit.el"
      # }
          system "make"
        ENV.deparallelize
        system "make", "install"


    end

    test do
      assert_equal "0123456789", shell_output("#{bin}/gsi -e \"(for-each write '(0 1 2 3 4 5 6 7 8 9))\"")
    end
  end
#+end_src


